{
  "pre_reg": "docs/superpowers/specs/2026-05-12-fm-rich-policy-vocab-adequacy-preregistration-note.md",
  "test": "fm-rich-policy-vocab-adequacy-#11",
  "substrate": "FM-2008Q1",
  "run_at": "2026-05-13T10-47-40Z",
  "policy": "fnma_eligibility_matrix",
  "policy_version": "0.1",
  "policy_status": "medium-fidelity-reconstruction",
  "regime_envelope": {
    "fico_floor": 620.0,
    "dti_ceiling": 50.0,
    "ltv_ceiling": 97.0,
    "conforming_upb": "auto-satisfied (FM acquisitions are conforming)"
  },
  "prep": {
    "n_after_dropna_keys": 322705,
    "upb_pctiles": {
      "50": 200000.0,
      "90": 376000.0,
      "99": 417000.0,
      "100": 802000.0
    },
    "frac_upb_over_453100": 0.0036,
    "n_in_regime_envelope": 257516,
    "frac_dropped_by_envelope": 0.2235,
    "default_rate": 0.04291,
    "high_cardinality_kept_buckets": {
      "seller_name": [
        "Amtrust Bank",
        "Bank Of America, N.A.",
        "Chase Home Finance, Llc",
        "Citimortgage, Inc.",
        "Fdic, Receiver, Indymac Federal Bank Fsb",
        "Flagstar Capital Markets Corporation",
        "Gmac Mortgage, Llc",
        "Hsbc Bank Usa, National Association",
        "Jpmorgan Chase Bank, National Association",
        "Other",
        "Pnc Bank, N.A.",
        "Suntrust Mortgage Inc.",
        "Wells Fargo Bank, N.A."
      ],
      "servicer_name": [
        "Bank Of America, N.A.",
        "Citimortgage, Inc.",
        "First Tennessee Bank, National Association",
        "Gmac Mortgage, Llc",
        "Jp Morgan Chase Bank, Na",
        "Jpmorgan Chase Bank, Na",
        "Other",
        "Phh Mortgage Corporation",
        "Pnc Bank, N.A.",
        "Regions Bank",
        "Suntrust Mortgage Inc.",
        "Usaa Federal Savings Bank",
        "Wells Fargo Bank, N.A."
      ]
    },
    "categorical_code_maps": {
      "loan_purpose": {
        "C": 0,
        "P": 1,
        "R": 2
      },
      "property_type": {
        "CO": 0,
        "CP": 1,
        "MH": 2,
        "PU": 3,
        "SF": 4
      },
      "first_time_homebuyer": {
        "N": 0,
        "Y": 1
      },
      "amortization_type": {
        "FRM": 0
      },
      "occupancy_status": {
        "P": 0
      },
      "property_state": {
        "AK": 0,
        "AL": 1,
        "AR": 2,
        "AZ": 3,
        "CA": 4,
        "CO": 5,
        "CT": 6,
        "DC": 7,
        "DE": 8,
        "FL": 9,
        "GA": 10,
        "GU": 11,
        "HI": 12,
        "IA": 13,
        "ID": 14,
        "IL": 15,
        "IN": 16,
        "KS": 17,
        "KY": 18,
        "LA": 19,
        "MA": 20,
        "MD": 21,
        "ME": 22,
        "MI": 23,
        "MN": 24,
        "MO": 25,
        "MS": 26,
        "MT": 27,
        "NC": 28,
        "ND": 29,
        "NE": 30,
        "NH": 31,
        "NJ": 32,
        "NM": 33,
        "NV": 34,
        "NY": 35,
        "OH": 36,
        "OK": 37,
        "OR": 38,
        "PA": 39,
        "PR": 40,
        "RI": 41,
        "SC": 42,
        "SD": 43,
        "TN": 44,
        "TX": 45,
        "UT": 46,
        "VA": 47,
        "VI": 48,
        "VT": 49,
        "WA": 50,
        "WI": 51,
        "WV": 52,
        "WY": 53
      },
      "seller_name": {
        "Amtrust Bank": 0,
        "Bank Of America, N.A.": 1,
        "Chase Home Finance, Llc": 2,
        "Citimortgage, Inc.": 3,
        "Fdic, Receiver, Indymac Federal Bank Fsb": 4,
        "Flagstar Capital Markets Corporation": 5,
        "Gmac Mortgage, Llc": 6,
        "Hsbc Bank Usa, National Association": 7,
        "Jpmorgan Chase Bank, National Association": 8,
        "Other": 9,
        "Pnc Bank, N.A.": 10,
        "Suntrust Mortgage Inc.": 11,
        "Wells Fargo Bank, N.A.": 12
      },
      "servicer_name": {
        "Bank Of America, N.A.": 0,
        "Citimortgage, Inc.": 1,
        "First Tennessee Bank, National Association": 2,
        "Gmac Mortgage, Llc": 3,
        "Jp Morgan Chase Bank, Na": 4,
        "Jpmorgan Chase Bank, Na": 5,
        "Other": 6,
        "Phh Mortgage Corporation": 7,
        "Pnc Bank, N.A.": 8,
        "Regions Bank": 9,
        "Suntrust Mortgage Inc.": 10,
        "Usaa Federal Savings Bank": 11,
        "Wells Fargo Bank, N.A.": 12
      }
    },
    "near_constant_dropped": [
      "amortization_type",
      "occupancy_status"
    ]
  },
  "named_features_exposed": [
    "fico_range_low",
    "dti",
    "ltv",
    "cltv",
    "mortgage_insurance_pct",
    "loan_term_months",
    "loan_purpose",
    "num_units",
    "num_borrowers",
    "first_time_homebuyer",
    "property_type"
  ],
  "extension_features_exposed": [
    "property_state",
    "original_upb",
    "seller_name",
    "servicer_name"
  ],
  "dropped_features": [
    "amortization_type",
    "occupancy_status"
  ],
  "monotonic_cst_default_convention": {
    "fico_range_low": -1,
    "dti": 1,
    "ltv": 1,
    "cltv": 1,
    "mortgage_insurance_pct": -1
  },
  "band_params": {
    "epsilon": 0.02,
    "depths": [
      1,
      2,
      3
    ],
    "leaf_mins": [
      25,
      50,
      100
    ],
    "seed": 0,
    "holdout_frac": 0.3,
    "plurality_rho_max": 0.9,
    "max_subset_size": 5,
    "dedup": "used-feature-set (highest-holdout-AUC representative)",
    "candidate_set": "named-policy features UNION extension features (orig_interest_rate excluded -- defines the rate stratum)"
  },
  "explainer_params": {
    "max_depth": 3,
    "min_samples_leaf": 50,
    "cv_folds": 5,
    "r2_good": 0.3,
    "dr2_ext_min": 0.15
  },
  "placebo_params": {
    "n_random_draws": 5,
    "seller_servicer_topk": 20,
    "msa_topk": 40
  },
  "eps_arm": [
    0.01,
    0.02,
    0.05
  ],
  "min_cell_loans": 5000,
  "probe": false,
  "strata": {
    "S_rate": {
      "stratum": "S-rate (orig_interest_rate deciles)",
      "cell_col": "s_rate",
      "cell_loan_counts": {
        "rb00": 33285,
        "rb01": 29013,
        "rb02": 15874,
        "rb03": 29495,
        "rb04": 38767,
        "rb05": 26872,
        "rb06": 18086,
        "rb07": 19380,
        "rb08": 30288,
        "rb09": 16456
      },
      "analyzed_cells": [
        "rb00",
        "rb01",
        "rb02",
        "rb03",
        "rb04",
        "rb05",
        "rb06",
        "rb07",
        "rb08",
        "rb09"
      ],
      "min_cell_loans": 5000,
      "cells": {
        "rb00": {
          "n": 33285,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 33285,
            "n_default": 283,
            "default_rate": 0.0085,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 1893,
            "band_distinct_by_tree_signature": 926,
            "n_distinct_uf_members": 42,
            "n_distinct_used_feature_sets": 29,
            "distinct_used_feature_sets": [
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "ltv"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "fico_range_low",
                "ltv",
                "seller_name"
              ],
              [
                "fico_range_low",
                "ltv",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "seller_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "property_state"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb",
                "property_state"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb",
                "seller_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state",
                "seller_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state",
                "servicer_name"
              ]
            ],
            "n_members_using_extension": 25,
            "extension_features_used_union": [
              "original_upb",
              "property_state",
              "seller_name",
              "servicer_name"
            ],
            "best_holdout_auc": 0.7876,
            "median_pairwise_spearman": 0.783,
            "min_pairwise_spearman": 0.5872,
            "plural": true,
            "d_summary": {
              "min": 0.000469,
              "median": 0.002041,
              "max": 0.050001,
              "std": 0.005084
            },
            "R2_named": 0.78,
            "R2_all": 0.8112,
            "dR2_ext": 0.0312,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.73
              ],
              [
                "ltv",
                0.2013
              ],
              [
                "loan_term_months",
                0.0652
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.7025
              ],
              [
                "ltv",
                0.1937
              ],
              [
                "property_state",
                0.0751
              ]
            ],
            "extension_importances_in_all_explainer": [
              [
                "property_state",
                0.0751
              ]
            ],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.6191,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001402,
                "mean_d_bottom_decile": 0.01367,
                "tail_over_mid": 5.692
              },
              "dti": {
                "spearman_rho": 0.4047,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005831,
                "mean_d_bottom_decile": 0.001957,
                "tail_over_mid": 1.76
              },
              "ltv": {
                "spearman_rho": 0.2569,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006626,
                "mean_d_bottom_decile": 0.002321,
                "tail_over_mid": 2.092
              },
              "cltv": {
                "spearman_rho": 0.247,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006291,
                "mean_d_bottom_decile": 0.002354,
                "tail_over_mid": 1.963
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.1378,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006356,
                "mean_d_bottom_decile": 0.003124,
                "tail_over_mid": 2.049
              },
              "loan_term_months": {
                "spearman_rho": 0.1082,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.004314,
                "mean_d_bottom_decile": 0.002848,
                "tail_over_mid": 1.272
              },
              "loan_purpose": {
                "spearman_rho": -0.066,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003074,
                "mean_d_bottom_decile": 0.003744,
                "tail_over_mid": 1.09
              },
              "num_units": {
                "spearman_rho": 0.0276,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003526,
                "mean_d_bottom_decile": 0.003469,
                "tail_over_mid": 1.034
              },
              "num_borrowers": {
                "spearman_rho": -0.2807,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.002949,
                "mean_d_bottom_decile": 0.004331,
                "tail_over_mid": 1.283
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0446,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003983,
                "mean_d_bottom_decile": 0.003363,
                "tail_over_mid": 1.183
              },
              "property_type": {
                "spearman_rho": -0.0108,
                "spearman_p": 0.0478,
                "mean_d_top_decile": 0.003379,
                "mean_d_bottom_decile": 0.003694,
                "tail_over_mid": 1.086
              },
              "property_state": {
                "spearman_rho": -0.0465,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.002846,
                "mean_d_bottom_decile": 0.00446,
                "tail_over_mid": 1.322
              },
              "original_upb": {
                "spearman_rho": 0.045,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003561,
                "mean_d_bottom_decile": 0.003023,
                "tail_over_mid": 1.028
              },
              "seller_name": {
                "spearman_rho": -0.0193,
                "spearman_p": 0.0004,
                "mean_d_top_decile": 0.00494,
                "mean_d_bottom_decile": 0.003496,
                "tail_over_mid": 1.529
              },
              "servicer_name": {
                "spearman_rho": -0.0055,
                "spearman_p": 0.3196,
                "mean_d_top_decile": 0.00494,
                "mean_d_bottom_decile": 0.003644,
                "tail_over_mid": 1.537
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "first_time_homebuyer",
                "loan_purpose",
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.286,
                "ltv": 0.262,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.262,
                "loan_purpose": 0.0,
                "num_units": 0.0,
                "num_borrowers": 0.476,
                "first_time_homebuyer": 0.0,
                "property_type": 0.048
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 33285,
            "n_default": 283,
            "default_rate": 0.0085,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 861,
            "band_distinct_by_tree_signature": 450,
            "n_distinct_uf_members": 21,
            "n_distinct_used_feature_sets": 13,
            "distinct_used_feature_sets": [
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "ltv"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ]
            ],
            "n_members_using_extension": 6,
            "extension_features_used_union": [
              "original_upb"
            ],
            "best_holdout_auc": 0.7867,
            "median_pairwise_spearman": 0.7823,
            "min_pairwise_spearman": 0.5879,
            "plural": true,
            "d_summary": {
              "min": 0.000441,
              "median": 0.002248,
              "max": 0.049823,
              "std": 0.004742
            },
            "R2_named": 0.8226,
            "R2_all": 0.8226,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.5899
              ],
              [
                "ltv",
                0.3048
              ],
              [
                "loan_term_months",
                0.1035
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.5899
              ],
              [
                "ltv",
                0.3048
              ],
              [
                "loan_term_months",
                0.1035
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.5865,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001457,
                "mean_d_bottom_decile": 0.01211,
                "tail_over_mid": 5.046
              },
              "dti": {
                "spearman_rho": 0.3638,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005332,
                "mean_d_bottom_decile": 0.001921,
                "tail_over_mid": 1.672
              },
              "ltv": {
                "spearman_rho": 0.2155,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006771,
                "mean_d_bottom_decile": 0.002097,
                "tail_over_mid": 2.266
              },
              "cltv": {
                "spearman_rho": 0.2086,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006422,
                "mean_d_bottom_decile": 0.002112,
                "tail_over_mid": 2.12
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.119,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.006493,
                "mean_d_bottom_decile": 0.002914,
                "tail_over_mid": 2.224
              },
              "loan_term_months": {
                "spearman_rho": 0.0998,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.004295,
                "mean_d_bottom_decile": 0.002614,
                "tail_over_mid": 1.329
              },
              "loan_purpose": {
                "spearman_rho": -0.0659,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003026,
                "mean_d_bottom_decile": 0.003468,
                "tail_over_mid": 1.056
              },
              "num_units": {
                "spearman_rho": 0.0309,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.00336,
                "mean_d_bottom_decile": 0.003295,
                "tail_over_mid": 1.029
              },
              "num_borrowers": {
                "spearman_rho": -0.2514,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.002831,
                "mean_d_bottom_decile": 0.004165,
                "tail_over_mid": 1.293
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0346,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003876,
                "mean_d_bottom_decile": 0.003175,
                "tail_over_mid": 1.206
              },
              "property_type": {
                "spearman_rho": -0.0044,
                "spearman_p": 0.4249,
                "mean_d_top_decile": 0.00327,
                "mean_d_bottom_decile": 0.003506,
                "tail_over_mid": 1.079
              },
              "original_upb": {
                "spearman_rho": 0.0358,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003453,
                "mean_d_bottom_decile": 0.00289,
                "tail_over_mid": 1.045
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "first_time_homebuyer",
                "loan_purpose",
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.286,
                "ltv": 0.381,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.381,
                "loan_purpose": 0.0,
                "num_units": 0.0,
                "num_borrowers": 0.381,
                "first_time_homebuyer": 0.0,
                "property_type": 0.048
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 14265
          },
          "seconds": 600.2,
          "placebo": {
            "C_random": {
              "d_rand_band_distinct_uf": 29,
              "R2_random_named_per_draw": [
                0.8072,
                0.8218,
                0.2801,
                0.8194,
                0.311
              ],
              "R2_random_named_mean": 0.6079,
              "R2_random_named_std": 0.2553
            },
            "C_scrambled": {
              "band_members_within_eps": 330,
              "band_distinct_uf": 43,
              "R2_scrambled_named": 0.8612,
              "scrambled_monotonicity_grant_conv": {
                "fico_range_low": 1,
                "dti": -1,
                "ltv": -1,
                "cltv": -1,
                "mortgage_insurance_pct": 1
              }
            }
          }
        },
        "rb01": {
          "n": 29013,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 29013,
            "n_default": 471,
            "default_rate": 0.01623,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 2517,
            "band_distinct_by_tree_signature": 2164,
            "n_distinct_uf_members": 82,
            "n_distinct_used_feature_sets": 45,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low"
              ],
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "seller_name"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "property_state"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "seller_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "servicer_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv",
                "seller_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "property_state"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "seller_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "seller_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "servicer_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "seller_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers",
                "seller_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers",
                "servicer_name"
              ]
            ],
            "n_members_using_extension": 43,
            "extension_features_used_union": [
              "original_upb",
              "property_state",
              "seller_name",
              "servicer_name"
            ],
            "best_holdout_auc": 0.7469,
            "median_pairwise_spearman": 0.6288,
            "min_pairwise_spearman": 0.6195,
            "plural": true,
            "d_summary": {
              "min": 0.000759,
              "median": 0.003645,
              "max": 0.06412,
              "std": 0.004998
            },
            "R2_named": 0.7713,
            "R2_all": 0.7961,
            "dR2_ext": 0.0248,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.857
              ],
              [
                "dti",
                0.1219
              ],
              [
                "ltv",
                0.0211
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8322
              ],
              [
                "dti",
                0.1184
              ],
              [
                "original_upb",
                0.0494
              ]
            ],
            "extension_importances_in_all_explainer": [
              [
                "original_upb",
                0.0494
              ]
            ],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.5015,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003383,
                "mean_d_bottom_decile": 0.013483,
                "tail_over_mid": 2.813
              },
              "dti": {
                "spearman_rho": 0.484,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.008596,
                "mean_d_bottom_decile": 0.003581,
                "tail_over_mid": 1.598
              },
              "ltv": {
                "spearman_rho": 0.1688,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.00742,
                "mean_d_bottom_decile": 0.004796,
                "tail_over_mid": 1.381
              },
              "cltv": {
                "spearman_rho": 0.1848,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.007159,
                "mean_d_bottom_decile": 0.004792,
                "tail_over_mid": 1.324
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.1618,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.007434,
                "mean_d_bottom_decile": 0.005227,
                "tail_over_mid": 1.398
              },
              "loan_term_months": {
                "spearman_rho": 0.0379,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005724,
                "mean_d_bottom_decile": 0.005368,
                "tail_over_mid": 1.038
              },
              "loan_purpose": {
                "spearman_rho": -0.0435,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005119,
                "mean_d_bottom_decile": 0.005692,
                "tail_over_mid": 1.026
              },
              "num_units": {
                "spearman_rho": 0.0338,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005789,
                "mean_d_bottom_decile": 0.00538,
                "tail_over_mid": 1.051
              },
              "num_borrowers": {
                "spearman_rho": -0.4223,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005118,
                "mean_d_bottom_decile": 0.006417,
                "tail_over_mid": 1.175
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0557,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005884,
                "mean_d_bottom_decile": 0.005383,
                "tail_over_mid": 1.071
              },
              "property_type": {
                "spearman_rho": -0.0208,
                "spearman_p": 0.0004,
                "mean_d_top_decile": 0.005771,
                "mean_d_bottom_decile": 0.005385,
                "tail_over_mid": 1.048
              },
              "property_state": {
                "spearman_rho": -0.0182,
                "spearman_p": 0.0019,
                "mean_d_top_decile": 0.005137,
                "mean_d_bottom_decile": 0.005503,
                "tail_over_mid": 0.988
              },
              "original_upb": {
                "spearman_rho": -0.022,
                "spearman_p": 0.0002,
                "mean_d_top_decile": 0.005557,
                "mean_d_bottom_decile": 0.005641,
                "tail_over_mid": 1.025
              },
              "seller_name": {
                "spearman_rho": -0.0326,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005876,
                "mean_d_bottom_decile": 0.005941,
                "tail_over_mid": 1.095
              },
              "servicer_name": {
                "spearman_rho": -0.0296,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005876,
                "mean_d_bottom_decile": 0.006236,
                "tail_over_mid": 1.157
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "first_time_homebuyer",
                "loan_purpose",
                "mortgage_insurance_pct",
                "num_units",
                "property_type"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.451,
                "ltv": 0.256,
                "cltv": 0.329,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.549,
                "loan_purpose": 0.0,
                "num_units": 0.0,
                "num_borrowers": 0.305,
                "first_time_homebuyer": 0.0,
                "property_type": 0.0
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 29013,
            "n_default": 471,
            "default_rate": 0.01623,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 1203,
            "band_distinct_by_tree_signature": 1026,
            "n_distinct_uf_members": 47,
            "n_distinct_used_feature_sets": 27,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low"
              ],
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers",
                "original_upb"
              ]
            ],
            "n_members_using_extension": 12,
            "extension_features_used_union": [
              "original_upb"
            ],
            "best_holdout_auc": 0.7469,
            "median_pairwise_spearman": 0.6288,
            "min_pairwise_spearman": 0.6195,
            "plural": true,
            "d_summary": {
              "min": 0.000816,
              "median": 0.003695,
              "max": 0.075748,
              "std": 0.005182
            },
            "R2_named": 0.7307,
            "R2_all": 0.7595,
            "dR2_ext": 0.0288,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.85
              ],
              [
                "dti",
                0.12
              ],
              [
                "ltv",
                0.0299
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8201
              ],
              [
                "dti",
                0.1158
              ],
              [
                "original_upb",
                0.0641
              ]
            ],
            "extension_importances_in_all_explainer": [
              [
                "original_upb",
                0.0641
              ]
            ],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.4157,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.003406,
                "mean_d_bottom_decile": 0.013525,
                "tail_over_mid": 2.843
              },
              "dti": {
                "spearman_rho": 0.4688,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.008607,
                "mean_d_bottom_decile": 0.003529,
                "tail_over_mid": 1.607
              },
              "ltv": {
                "spearman_rho": 0.1986,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.007499,
                "mean_d_bottom_decile": 0.004727,
                "tail_over_mid": 1.403
              },
              "cltv": {
                "spearman_rho": 0.2166,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.007255,
                "mean_d_bottom_decile": 0.004722,
                "tail_over_mid": 1.349
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.1731,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.007512,
                "mean_d_bottom_decile": 0.005196,
                "tail_over_mid": 1.421
              },
              "loan_term_months": {
                "spearman_rho": 0.0507,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005732,
                "mean_d_bottom_decile": 0.005286,
                "tail_over_mid": 1.043
              },
              "loan_purpose": {
                "spearman_rho": -0.0227,
                "spearman_p": 0.0001,
                "mean_d_top_decile": 0.005113,
                "mean_d_bottom_decile": 0.005649,
                "tail_over_mid": 1.022
              },
              "num_units": {
                "spearman_rho": 0.0297,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.005779,
                "mean_d_bottom_decile": 0.005358,
