{
  "pre_reg": "docs/superpowers/specs/2026-05-12-fm-rich-policy-vocab-adequacy-preregistration-note.md",
  "test": "fm-rich-policy-vocab-adequacy-#11",
  "substrate": "FM-2016Q1",
  "run_at": "2026-05-13T07-00-01Z",
  "policy": "fnma_eligibility_matrix",
  "policy_version": "0.1",
  "policy_status": "medium-fidelity-reconstruction",
  "regime_envelope": {
    "fico_floor": 620.0,
    "dti_ceiling": 50.0,
    "ltv_ceiling": 97.0,
    "conforming_upb": "auto-satisfied (FM acquisitions are conforming)"
  },
  "prep": {
    "n_after_dropna_keys": 354436,
    "upb_pctiles": {
      "50": 212000.0,
      "90": 398000.0,
      "99": 581000.0,
      "100": 1170000.0
    },
    "frac_upb_over_453100": 0.0369,
    "n_in_regime_envelope": 354426,
    "frac_dropped_by_envelope": 0.0005,
    "default_rate": 0.00762,
    "high_cardinality_kept_buckets": {
      "seller_name": [
        "Amerihome Mortgage Company, Llc",
        "Citimortgage, Inc.",
        "Ditech Financial Llc",
        "Finance Of America Mortgage Llc",
        "Flagstar Bank, Fsb",
        "Franklin American Mortgage Company",
        "Freedom Mortgage Corp.",
        "Impac Mortgage Corp.",
        "Jpmorgan Chase Bank, National Association",
        "Loandepot.Com, Llc",
        "Nationstar Mortgage, Llc",
        "Other",
        "Pmt Credit Risk Transfer Trust 2015-2",
        "Provident Funding Associates, L.P.",
        "Quicken Loans Inc.",
        "Stearns Lending, Llc",
        "Suntrust Bank",
        "U.S. Bank N.A.",
        "United Shore Financial Services, Llc D/B/A United Wholesale Mortgage",
        "Wells Fargo Bank, N.A.",
        "__other__"
      ],
      "servicer_name": [
        "Axia Financial, Llc",
        "Citimortgage, Inc.",
        "Ditech Financial Llc",
        "Jp Morgan Chase Bank, Na",
        "Lakeview Loan Servicing, Llc",
        "Matrix Financial Services Corporation",
        "Mortgage Access Corp.Dba Weichert Financial Services",
        "Nationstar Mortgage, Llc",
        "Other",
        "Pennymac Corp.",
        "Phh Mortgage Corporation",
        "Pingora Loan Servicing, Llc",
        "Pnc Bank, N.A.",
        "Quicken Loans Inc.",
        "Redwood Residential Acquisition Corporation",
        "Roundpoint Mortgage Servicing Corporation",
        "Seneca Mortgage Servicing Llc",
        "Suntrust Mortgage Inc.",
        "Wells Fargo Bank, N.A."
      ]
    },
    "categorical_code_maps": {
      "loan_purpose": {
        "C": 0,
        "P": 1,
        "R": 2
      },
      "property_type": {
        "CO": 0,
        "CP": 1,
        "MH": 2,
        "PU": 3,
        "SF": 4
      },
      "first_time_homebuyer": {
        "N": 0,
        "Y": 1
      },
      "amortization_type": {
        "FRM": 0
      },
      "occupancy_status": {
        "P": 0
      },
      "property_state": {
        "AK": 0,
        "AL": 1,
        "AR": 2,
        "AZ": 3,
        "CA": 4,
        "CO": 5,
        "CT": 6,
        "DC": 7,
        "DE": 8,
        "FL": 9,
        "GA": 10,
        "GU": 11,
        "HI": 12,
        "IA": 13,
        "ID": 14,
        "IL": 15,
        "IN": 16,
        "KS": 17,
        "KY": 18,
        "LA": 19,
        "MA": 20,
        "MD": 21,
        "ME": 22,
        "MI": 23,
        "MN": 24,
        "MO": 25,
        "MS": 26,
        "MT": 27,
        "NC": 28,
        "ND": 29,
        "NE": 30,
        "NH": 31,
        "NJ": 32,
        "NM": 33,
        "NV": 34,
        "NY": 35,
        "OH": 36,
        "OK": 37,
        "OR": 38,
        "PA": 39,
        "PR": 40,
        "RI": 41,
        "SC": 42,
        "SD": 43,
        "TN": 44,
        "TX": 45,
        "UT": 46,
        "VA": 47,
        "VI": 48,
        "VT": 49,
        "WA": 50,
        "WI": 51,
        "WV": 52,
        "WY": 53
      },
      "seller_name": {
        "Amerihome Mortgage Company, Llc": 0,
        "Citimortgage, Inc.": 1,
        "Ditech Financial Llc": 2,
        "Finance Of America Mortgage Llc": 3,
        "Flagstar Bank, Fsb": 4,
        "Franklin American Mortgage Company": 5,
        "Freedom Mortgage Corp.": 6,
        "Impac Mortgage Corp.": 7,
        "Jpmorgan Chase Bank, National Association": 8,
        "Loandepot.Com, Llc": 9,
        "Nationstar Mortgage, Llc": 10,
        "Other": 11,
        "Pmt Credit Risk Transfer Trust 2015-2": 12,
        "Provident Funding Associates, L.P.": 13,
        "Quicken Loans Inc.": 14,
        "Stearns Lending, Llc": 15,
        "Suntrust Bank": 16,
        "U.S. Bank N.A.": 17,
        "United Shore Financial Services, Llc D/B/A United Wholesale Mortgage": 18,
        "Wells Fargo Bank, N.A.": 19,
        "__other__": 20
      },
      "servicer_name": {
        "Axia Financial, Llc": 0,
        "Citimortgage, Inc.": 1,
        "Ditech Financial Llc": 2,
        "Jp Morgan Chase Bank, Na": 3,
        "Lakeview Loan Servicing, Llc": 4,
        "Matrix Financial Services Corporation": 5,
        "Mortgage Access Corp.Dba Weichert Financial Services": 6,
        "Nationstar Mortgage, Llc": 7,
        "Other": 8,
        "Pennymac Corp.": 9,
        "Phh Mortgage Corporation": 10,
        "Pingora Loan Servicing, Llc": 11,
        "Pnc Bank, N.A.": 12,
        "Quicken Loans Inc.": 13,
        "Redwood Residential Acquisition Corporation": 14,
        "Roundpoint Mortgage Servicing Corporation": 15,
        "Seneca Mortgage Servicing Llc": 16,
        "Suntrust Mortgage Inc.": 17,
        "Wells Fargo Bank, N.A.": 18
      }
    },
    "near_constant_dropped": [
      "amortization_type",
      "occupancy_status"
    ]
  },
  "named_features_exposed": [
    "fico_range_low",
    "dti",
    "ltv",
    "cltv",
    "mortgage_insurance_pct",
    "loan_term_months",
    "loan_purpose",
    "num_units",
    "num_borrowers",
    "first_time_homebuyer",
    "property_type"
  ],
  "extension_features_exposed": [
    "property_state",
    "original_upb",
    "seller_name",
    "servicer_name"
  ],
  "dropped_features": [
    "amortization_type",
    "occupancy_status"
  ],
  "monotonic_cst_default_convention": {
    "fico_range_low": -1,
    "dti": 1,
    "ltv": 1,
    "cltv": 1,
    "mortgage_insurance_pct": -1
  },
  "band_params": {
    "epsilon": 0.02,
    "depths": [
      1,
      2,
      3
    ],
    "leaf_mins": [
      25,
      50,
      100
    ],
    "seed": 0,
    "holdout_frac": 0.3,
    "plurality_rho_max": 0.9,
    "max_subset_size": 5,
    "dedup": "used-feature-set (highest-holdout-AUC representative)",
    "candidate_set": "named-policy features UNION extension features (orig_interest_rate excluded -- defines the rate stratum)"
  },
  "explainer_params": {
    "max_depth": 3,
    "min_samples_leaf": 50,
    "cv_folds": 5,
    "r2_good": 0.3,
    "dr2_ext_min": 0.15
  },
  "placebo_params": {
    "n_random_draws": 5,
    "seller_servicer_topk": 20,
    "msa_topk": 40
  },
  "eps_arm": [
    0.01,
    0.02,
    0.05
  ],
  "min_cell_loans": 5000,
  "probe": false,
  "strata": {
    "S_rate": {
      "stratum": "S-rate (orig_interest_rate deciles)",
      "cell_col": "s_rate",
      "cell_loan_counts": {
        "rb00": 45150,
        "rb01": 27482,
        "rb02": 63559,
        "rb03": 12267,
        "rb04": 39690,
        "rb05": 45692,
        "rb06": 43717,
        "rb07": 27436,
        "rb08": 17966,
        "rb09": 31467
      },
      "analyzed_cells": [
        "rb00",
        "rb01",
        "rb02",
        "rb03",
        "rb04",
        "rb05",
        "rb06",
        "rb07",
        "rb08",
        "rb09"
      ],
      "min_cell_loans": 5000,
      "cells": {
        "rb00": {
          "n": 45150,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 45150,
            "n_default": 112,
            "default_rate": 0.00248,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 93,
            "band_distinct_by_tree_signature": 54,
            "n_distinct_uf_members": 3,
            "n_distinct_used_feature_sets": 3,
            "distinct_used_feature_sets": [
              [
                "property_state"
              ],
              [
                "loan_purpose",
                "property_state"
              ],
              [
                "num_borrowers",
                "property_state"
              ]
            ],
            "n_members_using_extension": 3,
            "extension_features_used_union": [
              "property_state"
            ],
            "best_holdout_auc": 0.722,
            "median_pairwise_spearman": 0.3445,
            "min_pairwise_spearman": 0.3445,
            "plural": true,
            "d_summary": {
              "min": 0.0,
              "median": 0.000345,
              "max": 0.009956,
              "std": 0.000849
            },
            "R2_named": 0.0351,
            "R2_all": 0.5797,
            "dR2_ext": 0.5446,
            "explainer_named_root_feature": "cltv",
            "explainer_named_top_importances": [
              [
                "cltv",
                0.5244
              ],
              [
                "num_borrowers",
                0.2577
              ],
              [
                "loan_term_months",
                0.2179
              ]
            ],
            "explainer_all_root_feature": "property_state",
            "explainer_all_top_importances": [
              [
                "property_state",
                0.9676
              ],
              [
                "loan_purpose",
                0.0324
              ]
            ],
            "extension_importances_in_all_explainer": [
              [
                "property_state",
                0.9676
              ]
            ],
            "rung_classification": "3b-codification-irreducible",
            "pd_shape_d_on_named_root": "mixed",
            "well_explained_by_named": false,
            "gap_recurs": true,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": 0.0019,
                "spearman_p": 0.6912,
                "mean_d_top_decile": 0.000588,
                "mean_d_bottom_decile": 0.000668,
                "tail_over_mid": 1.117
              },
              "dti": {
                "spearman_rho": 0.0259,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000657,
                "mean_d_bottom_decile": 0.00055,
                "tail_over_mid": 1.087
              },
              "ltv": {
                "spearman_rho": -0.0301,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000683,
                "mean_d_bottom_decile": 0.000618,
                "tail_over_mid": 1.152
              },
              "cltv": {
                "spearman_rho": -0.0288,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000694,
                "mean_d_bottom_decile": 0.000619,
                "tail_over_mid": 1.174
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.0109,
                "spearman_p": 0.0208,
                "mean_d_top_decile": 0.000681,
                "mean_d_bottom_decile": 0.00059,
                "tail_over_mid": 1.142
              },
              "loan_term_months": {
                "spearman_rho": 0.0071,
                "spearman_p": 0.1311,
                "mean_d_top_decile": 0.000722,
                "mean_d_bottom_decile": 0.000605,
                "tail_over_mid": 1.224
              },
              "loan_purpose": {
                "spearman_rho": -0.012,
                "spearman_p": 0.0106,
                "mean_d_top_decile": 0.000581,
                "mean_d_bottom_decile": 0.000644,
                "tail_over_mid": 1.069
              },
              "num_units": {
                "spearman_rho": 0.0199,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000608,
                "mean_d_bottom_decile": 0.000595,
                "tail_over_mid": 1.005
              },
              "num_borrowers": {
                "spearman_rho": -0.066,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000532,
                "mean_d_bottom_decile": 0.000704,
                "tail_over_mid": 1.171
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0287,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000743,
                "mean_d_bottom_decile": 0.000583,
                "tail_over_mid": 1.26
              },
              "property_type": {
                "spearman_rho": 0.0166,
                "spearman_p": 0.0004,
                "mean_d_top_decile": 0.000584,
                "mean_d_bottom_decile": 0.000707,
                "tail_over_mid": 1.191
              },
              "property_state": {
                "spearman_rho": -0.6356,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.0,
                "mean_d_bottom_decile": 0.000617,
                "tail_over_mid": 0.91
              },
              "original_upb": {
                "spearman_rho": 0.0063,
                "spearman_p": 0.1781,
                "mean_d_top_decile": 0.000583,
                "mean_d_bottom_decile": 0.000782,
                "tail_over_mid": 1.338
              },
              "seller_name": {
                "spearman_rho": -0.0048,
                "spearman_p": 0.3052,
                "mean_d_top_decile": 0.000569,
                "mean_d_bottom_decile": 0.000574,
                "tail_over_mid": 0.937
              },
              "servicer_name": {
                "spearman_rho": -0.0047,
                "spearman_p": 0.3129,
                "mean_d_top_decile": 0.00057,
                "mean_d_bottom_decile": 0.000594,
                "tail_over_mid": 0.975
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "dti",
                "fico_range_low",
                "first_time_homebuyer",
                "loan_term_months",
                "ltv",
                "mortgage_insurance_pct",
                "num_units",
                "property_type"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 0.0,
                "dti": 0.0,
                "ltv": 0.0,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.0,
                "loan_purpose": 0.333,
                "num_units": 0.0,
                "num_borrowers": 0.333,
                "first_time_homebuyer": 0.0,
                "property_type": 0.0
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 45150,
            "n_default": 112,
            "default_rate": 0.00248,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 1334,
            "band_distinct_by_tree_signature": 1086,
            "n_distinct_uf_members": 91,
            "n_distinct_used_feature_sets": 38,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low"
              ],
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer"
              ],
              [
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "ltv"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "original_upb"
              ],
              [
                "fico_range_low",
                "property_type"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "first_time_homebuyer"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "property_type"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "cltv",
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv",
                "num_borrowers"
              ]
            ],
            "n_members_using_extension": 6,
            "extension_features_used_union": [
              "original_upb"
            ],
            "best_holdout_auc": 0.6219,
            "median_pairwise_spearman": 0.9972,
            "min_pairwise_spearman": 0.6428,
            "plural": false,
            "d_summary": {
              "min": 0.000112,
              "median": 0.000478,
              "max": 0.022463,
              "std": 0.001226
            },
            "R2_named": 0.7686,
            "R2_all": 0.7686,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.8852
              ],
              [
                "cltv",
                0.0911
              ],
              [
                "dti",
                0.0237
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8852
              ],
              [
                "cltv",
                0.0911
              ],
              [
                "dti",
                0.0237
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.778,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000231,
                "mean_d_bottom_decile": 0.002731,
                "tail_over_mid": 6.106
              },
              "dti": {
                "spearman_rho": 0.4407,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001134,
                "mean_d_bottom_decile": 0.000399,
                "tail_over_mid": 1.812
              },
              "ltv": {
                "spearman_rho": 0.1368,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000971,
                "mean_d_bottom_decile": 0.000473,
                "tail_over_mid": 1.525
              },
              "cltv": {
                "spearman_rho": 0.1407,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001003,
                "mean_d_bottom_decile": 0.000473,
                "tail_over_mid": 1.585
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.0871,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000951,
                "mean_d_bottom_decile": 0.000608,
                "tail_over_mid": 1.527
              },
              "loan_term_months": {
                "spearman_rho": 0.015,
                "spearman_p": 0.0014,
                "mean_d_top_decile": 0.000619,
                "mean_d_bottom_decile": 0.00063,
                "tail_over_mid": 0.953
              },
              "loan_purpose": {
                "spearman_rho": -0.0468,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000638,
                "mean_d_bottom_decile": 0.000713,
                "tail_over_mid": 1.1
              },
              "num_units": {
                "spearman_rho": 0.02,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000672,
                "mean_d_bottom_decile": 0.000637,
                "tail_over_mid": 1.027
              },
              "num_borrowers": {
                "spearman_rho": -0.1026,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000593,
                "mean_d_bottom_decile": 0.000769,
                "tail_over_mid": 1.189
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0513,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000772,
                "mean_d_bottom_decile": 0.000622,
                "tail_over_mid": 1.201
              },
              "property_type": {
                "spearman_rho": 0.015,
                "spearman_p": 0.0015,
                "mean_d_top_decile": 0.000683,
                "mean_d_bottom_decile": 0.000632,
                "tail_over_mid": 1.047
              },
              "original_upb": {
                "spearman_rho": -0.001,
                "spearman_p": 0.8375,
                "mean_d_top_decile": 0.000598,
                "mean_d_bottom_decile": 0.000879,
                "tail_over_mid": 1.389
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.308,
                "ltv": 0.495,
                "cltv": 0.33,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.088,
                "loan_purpose": 0.319,
                "num_units": 0.0,
                "num_borrowers": 0.22,
                "first_time_homebuyer": 0.077,
                "property_type": 0.022
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 14265
          },
          "seconds": 738.0,
          "placebo": {
            "C_random": {
              "d_rand_band_distinct_uf": 3,
              "R2_random_named_per_draw": [
                0.5624,
                0.5624,
                0.0318,
                0.5624,
                0.5604
              ],
              "R2_random_named_mean": 0.4559,
              "R2_random_named_std": 0.212
            },
            "C_scrambled": {
              "band_members_within_eps": 489,
              "band_distinct_uf": 7,
              "R2_scrambled_named": 0.0352,
              "scrambled_monotonicity_grant_conv": {
                "fico_range_low": 1,
                "dti": -1,
                "ltv": -1,
                "cltv": -1,
                "mortgage_insurance_pct": 1
              }
            }
          }
        },
        "rb01": {
          "n": 27482,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 27482,
            "n_default": 100,
            "default_rate": 0.00364,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 2382,
            "band_distinct_by_tree_signature": 911,
            "n_distinct_uf_members": 72,
            "n_distinct_used_feature_sets": 40,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low"
              ],
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "ltv"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "property_type"
              ],
              [
                "fico_range_low",
                "seller_name"
              ],
              [
                "fico_range_low",
                "servicer_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "seller_name"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "property_type"
              ],
              [
                "fico_range_low",
                "property_type",
                "seller_name"
              ],
              [
                "fico_range_low",
                "property_type",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "seller_name",
                "servicer_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type",
                "seller_name"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "property_type",
                "seller_name",
                "servicer_name"
              ]
            ],
            "n_members_using_extension": 12,
            "extension_features_used_union": [
              "seller_name",
              "servicer_name"
            ],
            "best_holdout_auc": 0.8135,
            "median_pairwise_spearman": 0.9515,
            "min_pairwise_spearman": 0.8996,
            "plural": false,
            "d_summary": {
              "min": 0.000212,
              "median": 0.000285,
              "max": 0.016489,
              "std": 0.00174
            },
            "R2_named": 0.9358,
            "R2_all": 0.9358,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.8967
              ],
              [
                "property_type",
                0.0777
              ],
              [
                "dti",
                0.0239
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8967
              ],
              [
                "property_type",
                0.0777
              ],
              [
                "dti",
                0.0239
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.8583,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000315,
                "mean_d_bottom_decile": 0.004188,
                "tail_over_mid": 6.976
              },
              "dti": {
                "spearman_rho": 0.261,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001547,
                "mean_d_bottom_decile": 0.000586,
                "tail_over_mid": 1.725
              },
              "ltv": {
                "spearman_rho": 0.0674,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001074,
                "mean_d_bottom_decile": 0.000831,
                "tail_over_mid": 1.161
              },
              "cltv": {
                "spearman_rho": 0.0695,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001076,
                "mean_d_bottom_decile": 0.000835,
                "tail_over_mid": 1.164
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.0405,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001018,
                "mean_d_bottom_decile": 0.000925,
                "tail_over_mid": 1.105
              },
              "loan_term_months": {
                "spearman_rho": -0.2696,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000548,
                "mean_d_bottom_decile": 0.001385,
                "tail_over_mid": 1.502
              },
              "loan_purpose": {
                "spearman_rho": -0.2574,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000866,
                "mean_d_bottom_decile": 0.001151,
                "tail_over_mid": 1.263
              },
              "num_units": {
                "spearman_rho": 0.007,
                "spearman_p": 0.2438,
                "mean_d_top_decile": 0.000945,
                "mean_d_bottom_decile": 0.000973,
                "tail_over_mid": 1.053
              },
              "num_borrowers": {
                "spearman_rho": -0.0704,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000781,
                "mean_d_bottom_decile": 0.001093,
                "tail_over_mid": 1.177
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0045,
                "spearman_p": 0.4517,
                "mean_d_top_decile": 0.000944,
                "mean_d_bottom_decile": 0.00095,
                "tail_over_mid": 1.025
              },
              "property_type": {
                "spearman_rho": 0.052,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000912,
                "mean_d_bottom_decile": 0.000989,
                "tail_over_mid": 1.068
              },
              "property_state": {
                "spearman_rho": 0.0286,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000808,
                "mean_d_bottom_decile": 0.000826,
                "tail_over_mid": 0.861
              },
              "original_upb": {
                "spearman_rho": -0.1383,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000629,
                "mean_d_bottom_decile": 0.001343,
                "tail_over_mid": 1.464
              },
              "seller_name": {
                "spearman_rho": 0.1096,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001111,
                "mean_d_bottom_decile": 0.000923,
                "tail_over_mid": 1.222
              },
              "servicer_name": {
                "spearman_rho": 0.1209,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001052,
                "mean_d_bottom_decile": 0.000978,
                "tail_over_mid": 1.156
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "first_time_homebuyer",
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.194,
                "ltv": 0.194,
                "cltv": 0.111,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.222,
                "loan_purpose": 0.389,
                "num_units": 0.0,
                "num_borrowers": 0.208,
                "first_time_homebuyer": 0.0,
                "property_type": 0.208
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 27482,
            "n_default": 100,
            "default_rate": 0.00364,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 1158,
            "band_distinct_by_tree_signature": 503,
            "n_distinct_uf_members": 60,
            "n_distinct_used_feature_sets": 30,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low"
              ],
              [
                "dti",
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "ltv"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "property_type"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "property_type"
              ],
              [
                "cltv",
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "ltv"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "ltv",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "ltv",
                "num_borrowers"
              ]
            ],
            "n_members_using_extension": 0,
            "extension_features_used_union": [],
            "best_holdout_auc": 0.8135,
            "median_pairwise_spearman": 0.9527,
            "min_pairwise_spearman": 0.9005,
            "plural": false,
            "d_summary": {
              "min": 0.000213,
              "median": 0.000291,
              "max": 0.015897,
              "std": 0.001725
            },
            "R2_named": 0.9205,
            "R2_all": 0.9205,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.8982
              ],
              [
                "property_type",
                0.0624
              ],
              [
                "dti",
                0.0284
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8982
              ],
              [
                "property_type",
                0.0624
              ],
              [
                "dti",
                0.0284
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "monotone",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.8651,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000317,
                "mean_d_bottom_decile": 0.004103,
                "tail_over_mid": 7.606
              },
              "dti": {
                "spearman_rho": 0.2659,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001549,
                "mean_d_bottom_decile": 0.000536,
                "tail_over_mid": 1.863
              },
              "ltv": {
                "spearman_rho": 0.0936,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001063,
                "mean_d_bottom_decile": 0.000773,
                "tail_over_mid": 1.232
              },
              "cltv": {
                "spearman_rho": 0.095,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001063,
                "mean_d_bottom_decile": 0.000779,
                "tail_over_mid": 1.234
              },
              "mortgage_insurance_pct": {
                "spearman_rho": 0.0615,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001005,
                "mean_d_bottom_decile": 0.000863,
                "tail_over_mid": 1.17
              },
              "loan_term_months": {
                "spearman_rho": -0.2357,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000537,
                "mean_d_bottom_decile": 0.001305,
                "tail_over_mid": 1.514
              },
              "loan_purpose": {
                "spearman_rho": -0.2628,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000807,
                "mean_d_bottom_decile": 0.001072,
                "tail_over_mid": 1.25
              },
              "num_units": {
                "spearman_rho": 0.0047,
                "spearman_p": 0.4397,
                "mean_d_top_decile": 0.000893,
                "mean_d_bottom_decile": 0.000916,
                "tail_over_mid": 1.059
              },
              "num_borrowers": {
                "spearman_rho": -0.0777,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000719,
                "mean_d_bottom_decile": 0.001044,
                "tail_over_mid": 1.198
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0233,
                "spearman_p": 0.0001,
                "mean_d_top_decile": 0.000918,
                "mean_d_bottom_decile": 0.000888,
                "tail_over_mid": 1.06
              },
              "property_type": {
                "spearman_rho": 0.0587,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000863,
                "mean_d_bottom_decile": 0.000923,
                "tail_over_mid": 1.062
              },
              "original_upb": {
                "spearman_rho": -0.1322,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000589,
                "mean_d_bottom_decile": 0.001294,
                "tail_over_mid": 1.511
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
