{
  "pre_reg": "docs/superpowers/specs/2026-05-12-fm-rich-policy-vocab-adequacy-preregistration-note.md",
  "test": "fm-rich-policy-vocab-adequacy-#11",
  "substrate": "FM-2018Q1",
  "run_at": "2026-05-13T02-27-28Z",
  "policy": "fnma_eligibility_matrix",
  "policy_version": "0.1",
  "policy_status": "medium-fidelity-reconstruction",
  "regime_envelope": {
    "fico_floor": 620.0,
    "dti_ceiling": 50.0,
    "ltv_ceiling": 97.0,
    "conforming_upb": "auto-satisfied (FM acquisitions are conforming)"
  },
  "prep": {
    "n_after_dropna_keys": 401276,
    "upb_pctiles": {
      "50": 217000.0,
      "90": 413000.0,
      "99": 607000.0,
      "100": 1307000.0
    },
    "frac_upb_over_453100": 0.0419,
    "n_in_regime_envelope": 401275,
    "frac_dropped_by_envelope": 0.0009,
    "default_rate": 0.00796,
    "high_cardinality_kept_buckets": {
      "seller_name": [
        "Amerihome Mortgage Company, Llc",
        "Bvrt Trust",
        "Caliber Home Loans, Inc.",
        "Fairway Independent Mortgage Corporation",
        "Flagstar Bank, Fsb",
        "Franklin American Mortgage Company",
        "Freedom Mortgage Corp.",
        "Guild Mortgage Company",
        "Jpmorgan Chase Bank, National Association",
        "Lakeview Loan Servicing, Llc",
        "Loandepot.Com, Llc",
        "Movement Mortgage, Llc",
        "Nationstar Mortgage, Llc",
        "Other",
        "Pmtt4",
        "Quicken Loans, Llc",
        "Truist Bank (Formerly Suntrust Bank)",
        "U.S. Bank N.A.",
        "United Shore Financial Services, Llc Dba United Wholesale Mortgage",
        "Wells Fargo Bank, N.A.",
        "__other__"
      ],
      "servicer_name": [
        "Caliber Home Loans, Inc.",
        "Freedom Mortgage Corp.",
        "Homebridge Financial Services, Inc.",
        "Jp Morgan Chase Bank, Na",
        "Jpmorgan Chase Bank, Na",
        "Lakeview Loan Servicing, Llc",
        "Matrix Financial Services Corporation",
        "Nationstar Mortgage, Llc",
        "New Residential Mortgage Llc",
        "Other",
        "Pennymac Corp.",
        "Pingora Loan Servicing, Llc",
        "Pnc Bank, N.A.",
        "Provident Funding Associates, L.P.",
        "Quicken Loans Inc.",
        "Roundpoint Mortgage Servicing Corporation",
        "Truist Bank (Formerly Suntrust Bank)",
        "U.S. Bank N.A.",
        "Utah Housing Corporation",
        "Wells Fargo Bank, N.A.",
        "__other__"
      ]
    },
    "categorical_code_maps": {
      "loan_purpose": {
        "C": 0,
        "P": 1,
        "R": 2
      },
      "property_type": {
        "CO": 0,
        "CP": 1,
        "MH": 2,
        "PU": 3,
        "SF": 4
      },
      "first_time_homebuyer": {
        "N": 0,
        "Y": 1
      },
      "amortization_type": {
        "FRM": 0
      },
      "occupancy_status": {
        "P": 0
      },
      "property_state": {
        "AK": 0,
        "AL": 1,
        "AR": 2,
        "AZ": 3,
        "CA": 4,
        "CO": 5,
        "CT": 6,
        "DC": 7,
        "DE": 8,
        "FL": 9,
        "GA": 10,
        "GU": 11,
        "HI": 12,
        "IA": 13,
        "ID": 14,
        "IL": 15,
        "IN": 16,
        "KS": 17,
        "KY": 18,
        "LA": 19,
        "MA": 20,
        "MD": 21,
        "ME": 22,
        "MI": 23,
        "MN": 24,
        "MO": 25,
        "MS": 26,
        "MT": 27,
        "NC": 28,
        "ND": 29,
        "NE": 30,
        "NH": 31,
        "NJ": 32,
        "NM": 33,
        "NV": 34,
        "NY": 35,
        "OH": 36,
        "OK": 37,
        "OR": 38,
        "PA": 39,
        "PR": 40,
        "RI": 41,
        "SC": 42,
        "SD": 43,
        "TN": 44,
        "TX": 45,
        "UT": 46,
        "VA": 47,
        "VI": 48,
        "VT": 49,
        "WA": 50,
        "WI": 51,
        "WV": 52,
        "WY": 53
      },
      "seller_name": {
        "Amerihome Mortgage Company, Llc": 0,
        "Bvrt Trust": 1,
        "Caliber Home Loans, Inc.": 2,
        "Fairway Independent Mortgage Corporation": 3,
        "Flagstar Bank, Fsb": 4,
        "Franklin American Mortgage Company": 5,
        "Freedom Mortgage Corp.": 6,
        "Guild Mortgage Company": 7,
        "Jpmorgan Chase Bank, National Association": 8,
        "Lakeview Loan Servicing, Llc": 9,
        "Loandepot.Com, Llc": 10,
        "Movement Mortgage, Llc": 11,
        "Nationstar Mortgage, Llc": 12,
        "Other": 13,
        "Pmtt4": 14,
        "Quicken Loans, Llc": 15,
        "Truist Bank (Formerly Suntrust Bank)": 16,
        "U.S. Bank N.A.": 17,
        "United Shore Financial Services, Llc Dba United Wholesale Mortgage": 18,
        "Wells Fargo Bank, N.A.": 19,
        "__other__": 20
      },
      "servicer_name": {
        "Caliber Home Loans, Inc.": 0,
        "Freedom Mortgage Corp.": 1,
        "Homebridge Financial Services, Inc.": 2,
        "Jp Morgan Chase Bank, Na": 3,
        "Jpmorgan Chase Bank, Na": 4,
        "Lakeview Loan Servicing, Llc": 5,
        "Matrix Financial Services Corporation": 6,
        "Nationstar Mortgage, Llc": 7,
        "New Residential Mortgage Llc": 8,
        "Other": 9,
        "Pennymac Corp.": 10,
        "Pingora Loan Servicing, Llc": 11,
        "Pnc Bank, N.A.": 12,
        "Provident Funding Associates, L.P.": 13,
        "Quicken Loans Inc.": 14,
        "Roundpoint Mortgage Servicing Corporation": 15,
        "Truist Bank (Formerly Suntrust Bank)": 16,
        "U.S. Bank N.A.": 17,
        "Utah Housing Corporation": 18,
        "Wells Fargo Bank, N.A.": 19,
        "__other__": 20
      }
    },
    "near_constant_dropped": [
      "amortization_type",
      "occupancy_status"
    ]
  },
  "named_features_exposed": [
    "fico_range_low",
    "dti",
    "ltv",
    "cltv",
    "mortgage_insurance_pct",
    "loan_term_months",
    "loan_purpose",
    "num_units",
    "num_borrowers",
    "first_time_homebuyer",
    "property_type"
  ],
  "extension_features_exposed": [
    "property_state",
    "original_upb",
    "seller_name",
    "servicer_name"
  ],
  "dropped_features": [
    "amortization_type",
    "occupancy_status"
  ],
  "monotonic_cst_default_convention": {
    "fico_range_low": -1,
    "dti": 1,
    "ltv": 1,
    "cltv": 1,
    "mortgage_insurance_pct": -1
  },
  "band_params": {
    "epsilon": 0.02,
    "depths": [
      1,
      2,
      3
    ],
    "leaf_mins": [
      25,
      50,
      100
    ],
    "seed": 0,
    "holdout_frac": 0.3,
    "plurality_rho_max": 0.9,
    "max_subset_size": 5,
    "dedup": "used-feature-set (highest-holdout-AUC representative)",
    "candidate_set": "named-policy features UNION extension features (orig_interest_rate excluded -- defines the rate stratum)"
  },
  "explainer_params": {
    "max_depth": 3,
    "min_samples_leaf": 50,
    "cv_folds": 5,
    "r2_good": 0.3,
    "dr2_ext_min": 0.15
  },
  "placebo_params": {
    "n_random_draws": 5,
    "seller_servicer_topk": 20,
    "msa_topk": 40
  },
  "eps_arm": [
    0.01,
    0.02,
    0.05
  ],
  "min_cell_loans": 5000,
  "probe": false,
  "strata": {
    "S_rate": {
      "stratum": "S-rate (orig_interest_rate deciles)",
      "cell_col": "s_rate",
      "cell_loan_counts": {
        "rb00": 59283,
        "rb01": 44341,
        "rb02": 50974,
        "rb03": 35896,
        "rb04": 67317,
        "rb05": 40903,
        "rb06": 27777,
        "rb07": 37441,
        "rb08": 37343
      },
      "analyzed_cells": [
        "rb00",
        "rb01",
        "rb02",
        "rb03",
        "rb04",
        "rb05",
        "rb06",
        "rb07",
        "rb08"
      ],
      "min_cell_loans": 5000,
      "cells": {
        "rb00": {
          "n": 59283,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 59283,
            "n_default": 123,
            "default_rate": 0.00207,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 615,
            "band_distinct_by_tree_signature": 407,
            "n_distinct_uf_members": 30,
            "n_distinct_used_feature_sets": 28,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer"
              ],
              [
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "property_state"
              ],
              [
                "fico_range_low",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "first_time_homebuyer",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "first_time_homebuyer",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
                "property_type",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "seller_name",
                "servicer_name"
              ],
              [
                "dti",
                "fico_range_low",
                "first_time_homebuyer",
                "loan_term_months",
                "seller_name"
              ]
            ],
            "n_members_using_extension": 16,
            "extension_features_used_union": [
              "original_upb",
              "property_state",
              "seller_name",
              "servicer_name"
            ],
            "best_holdout_auc": 0.7845,
            "median_pairwise_spearman": 0.5903,
            "min_pairwise_spearman": 0.5556,
            "plural": true,
            "d_summary": {
              "min": 5.5e-05,
              "median": 0.000454,
              "max": 0.015475,
              "std": 0.000955
            },
            "R2_named": 0.8983,
            "R2_all": 0.8969,
            "dR2_ext": -0.0014,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.8564
              ],
              [
                "loan_term_months",
                0.1217
              ],
              [
                "first_time_homebuyer",
                0.0108
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.8564
              ],
              [
                "loan_term_months",
                0.1217
              ],
              [
                "first_time_homebuyer",
                0.0108
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "tails",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.3938,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000355,
                "mean_d_bottom_decile": 0.002321,
                "tail_over_mid": 5.624
              },
              "dti": {
                "spearman_rho": 0.0199,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000716,
                "mean_d_bottom_decile": 0.00044,
                "tail_over_mid": 1.187
              },
              "ltv": {
                "spearman_rho": 0.0108,
                "spearman_p": 0.0085,
                "mean_d_top_decile": 0.000625,
                "mean_d_bottom_decile": 0.000511,
                "tail_over_mid": 1.033
              },
              "cltv": {
                "spearman_rho": 0.0115,
                "spearman_p": 0.005,
                "mean_d_top_decile": 0.000638,
                "mean_d_bottom_decile": 0.000511,
                "tail_over_mid": 1.056
              },
              "mortgage_insurance_pct": {
                "spearman_rho": -0.0065,
                "spearman_p": 0.1121,
                "mean_d_top_decile": 0.00057,
                "mean_d_bottom_decile": 0.000605,
                "tail_over_mid": 1.008
              },
              "loan_term_months": {
                "spearman_rho": -0.0971,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000488,
                "mean_d_bottom_decile": 0.00063,
                "tail_over_mid": 1.038
              },
              "loan_purpose": {
                "spearman_rho": 0.0123,
                "spearman_p": 0.0028,
                "mean_d_top_decile": 0.000593,
                "mean_d_bottom_decile": 0.000659,
                "tail_over_mid": 1.115
              },
              "num_units": {
                "spearman_rho": 0.0015,
                "spearman_p": 0.7106,
                "mean_d_top_decile": 0.000595,
                "mean_d_bottom_decile": 0.000613,
                "tail_over_mid": 1.028
              },
              "num_borrowers": {
                "spearman_rho": -0.2738,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000544,
                "mean_d_bottom_decile": 0.00066,
                "tail_over_mid": 1.106
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0226,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000684,
                "mean_d_bottom_decile": 0.000592,
                "tail_over_mid": 1.163
              },
              "property_type": {
                "spearman_rho": 0.0123,
                "spearman_p": 0.0027,
                "mean_d_top_decile": 0.000607,
                "mean_d_bottom_decile": 0.000625,
                "tail_over_mid": 1.053
              },
              "property_state": {
                "spearman_rho": -0.0144,
                "spearman_p": 0.0005,
                "mean_d_top_decile": 0.000527,
                "mean_d_bottom_decile": 0.000631,
                "tail_over_mid": 1.047
              },
              "original_upb": {
                "spearman_rho": -0.1165,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.00051,
                "mean_d_bottom_decile": 0.000802,
                "tail_over_mid": 1.374
              },
              "seller_name": {
                "spearman_rho": -0.0341,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000514,
                "mean_d_bottom_decile": 0.000556,
                "tail_over_mid": 0.905
              },
              "servicer_name": {
                "spearman_rho": -0.0253,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000515,
                "mean_d_bottom_decile": 0.000607,
                "tail_over_mid": 0.999
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "ltv",
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.467,
                "ltv": 0.0,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.233,
                "loan_purpose": 0.1,
                "num_units": 0.0,
                "num_borrowers": 0.233,
                "first_time_homebuyer": 0.233,
                "property_type": 0.2
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 59283,
            "n_default": 123,
            "default_rate": 0.00207,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 274,
            "band_distinct_by_tree_signature": 130,
            "n_distinct_uf_members": 15,
            "n_distinct_used_feature_sets": 15,
            "distinct_used_feature_sets": [
              [
                "fico_range_low"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer"
              ],
              [
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "first_time_homebuyer"
              ],
              [
                "dti",
                "fico_range_low",
                "property_type"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "loan_term_months"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "property_type"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ]
            ],
            "n_members_using_extension": 0,
            "extension_features_used_union": [],
            "best_holdout_auc": 0.784,
            "median_pairwise_spearman": 0.5903,
            "min_pairwise_spearman": 0.5556,
            "plural": true,
            "d_summary": {
              "min": 6.2e-05,
              "median": 0.000472,
              "max": 0.016826,
              "std": 0.000902
            },
            "R2_named": 0.89,
            "R2_all": 0.89,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.7031
              ],
              [
                "loan_term_months",
                0.2312
              ],
              [
                "first_time_homebuyer",
                0.0655
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.7031
              ],
              [
                "loan_term_months",
                0.2312
              ],
              [
                "first_time_homebuyer",
                0.0655
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "tails",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.4027,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000345,
                "mean_d_bottom_decile": 0.002167,
                "tail_over_mid": 5.666
              },
              "dti": {
                "spearman_rho": 0.0491,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000669,
                "mean_d_bottom_decile": 0.00042,
                "tail_over_mid": 1.195
              },
              "ltv": {
                "spearman_rho": 0.0048,
                "spearman_p": 0.2441,
                "mean_d_top_decile": 0.000596,
                "mean_d_bottom_decile": 0.00048,
                "tail_over_mid": 1.062
              },
              "cltv": {
                "spearman_rho": 0.0055,
                "spearman_p": 0.1833,
                "mean_d_top_decile": 0.000608,
                "mean_d_bottom_decile": 0.000481,
                "tail_over_mid": 1.086
              },
              "mortgage_insurance_pct": {
                "spearman_rho": -0.014,
                "spearman_p": 0.0007,
                "mean_d_top_decile": 0.000542,
                "mean_d_bottom_decile": 0.000565,
                "tail_over_mid": 1.012
              },
              "loan_term_months": {
                "spearman_rho": -0.0921,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000474,
                "mean_d_bottom_decile": 0.000586,
                "tail_over_mid": 1.04
              },
              "loan_purpose": {
                "spearman_rho": 0.0034,
                "spearman_p": 0.4069,
                "mean_d_top_decile": 0.000536,
                "mean_d_bottom_decile": 0.000617,
                "tail_over_mid": 1.118
              },
              "num_units": {
                "spearman_rho": 0.0018,
                "spearman_p": 0.6587,
                "mean_d_top_decile": 0.000555,
                "mean_d_bottom_decile": 0.000575,
                "tail_over_mid": 1.036
              },
              "num_borrowers": {
                "spearman_rho": -0.2172,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000503,
                "mean_d_bottom_decile": 0.000617,
                "tail_over_mid": 1.109
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0025,
                "spearman_p": 0.5477,
                "mean_d_top_decile": 0.000667,
                "mean_d_bottom_decile": 0.000549,
                "tail_over_mid": 1.226
              },
              "property_type": {
                "spearman_rho": 0.0288,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000563,
                "mean_d_bottom_decile": 0.000624,
                "tail_over_mid": 1.14
              },
              "original_upb": {
                "spearman_rho": -0.108,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000465,
                "mean_d_bottom_decile": 0.000749,
                "tail_over_mid": 1.375
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "ltv",
                "mortgage_insurance_pct",
                "num_units"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 1.0,
                "dti": 0.133,
                "ltv": 0.0,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.267,
                "loan_purpose": 0.2,
                "num_units": 0.0,
                "num_borrowers": 0.333,
                "first_time_homebuyer": 0.267,
                "property_type": 0.333
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 14265
          },
          "seconds": 1006.1,
          "placebo": {
            "C_random": {
              "d_rand_band_distinct_uf": 17,
              "R2_random_named_per_draw": [
                0.7487,
                0.7487,
                0.0247,
                0.7487,
                0.0255
              ],
              "R2_random_named_mean": 0.4593,
              "R2_random_named_std": 0.3545
            },
            "C_scrambled": {
              "band_members_within_eps": 1714,
              "band_distinct_uf": 80,
              "R2_scrambled_named": 0.3729,
              "scrambled_monotonicity_grant_conv": {
                "fico_range_low": 1,
                "dti": -1,
                "ltv": -1,
                "cltv": -1,
                "mortgage_insurance_pct": 1
              }
            }
          }
        },
        "rb01": {
          "n": 44341,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 44341,
            "n_default": 110,
            "default_rate": 0.00248,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 204,
            "band_distinct_by_tree_signature": 183,
            "n_distinct_uf_members": 17,
            "n_distinct_used_feature_sets": 8,
            "distinct_used_feature_sets": [
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "seller_name"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "servicer_name"
              ],
              [
                "loan_purpose",
                "num_borrowers",
                "num_units"
              ]
            ],
            "n_members_using_extension": 7,
            "extension_features_used_union": [
              "seller_name",
              "servicer_name"
            ],
            "best_holdout_auc": 0.7683,
            "median_pairwise_spearman": 1.0,
            "min_pairwise_spearman": 0.5146,
            "plural": false,
            "d_summary": {
              "min": 3.9e-05,
              "median": 0.000477,
              "max": 0.015085,
              "std": 0.001219
            },
            "R2_named": 0.9493,
            "R2_all": 0.9493,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.9673
              ],
              [
                "num_borrowers",
                0.0324
              ],
              [
                "loan_purpose",
                0.0003
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.9673
              ],
              [
                "num_borrowers",
                0.0324
              ],
              [
                "loan_purpose",
                0.0003
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "tails",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.111,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000477,
                "mean_d_bottom_decile": 0.00246,
                "tail_over_mid": 5.525
              },
              "dti": {
                "spearman_rho": 0.0761,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000804,
                "mean_d_bottom_decile": 0.000544,
                "tail_over_mid": 1.248
              },
              "ltv": {
                "spearman_rho": -0.0477,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000573,
                "mean_d_bottom_decile": 0.000823,
                "tail_over_mid": 1.29
              },
              "cltv": {
                "spearman_rho": -0.0495,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000582,
                "mean_d_bottom_decile": 0.000819,
                "tail_over_mid": 1.285
              },
              "mortgage_insurance_pct": {
                "spearman_rho": -0.0019,
                "spearman_p": 0.6968,
                "mean_d_top_decile": 0.000457,
                "mean_d_bottom_decile": 0.000705,
                "tail_over_mid": 1.058
              },
              "loan_term_months": {
                "spearman_rho": -0.0846,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000526,
                "mean_d_bottom_decile": 0.001244,
                "tail_over_mid": 2.104
              },
              "loan_purpose": {
                "spearman_rho": -0.0646,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000719,
                "mean_d_bottom_decile": 0.001031,
                "tail_over_mid": 1.738
              },
              "num_units": {
                "spearman_rho": 0.028,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000656,
                "mean_d_bottom_decile": 0.000643,
                "tail_over_mid": 1.01
              },
              "num_borrowers": {
                "spearman_rho": -0.6029,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000412,
                "mean_d_bottom_decile": 0.000875,
                "tail_over_mid": 1.343
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0361,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000564,
                "mean_d_bottom_decile": 0.000668,
                "tail_over_mid": 1.015
              },
              "property_type": {
                "spearman_rho": -0.0104,
                "spearman_p": 0.0278,
                "mean_d_top_decile": 0.000696,
                "mean_d_bottom_decile": 0.000678,
                "tail_over_mid": 1.087
              },
              "property_state": {
                "spearman_rho": -0.0301,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000591,
                "mean_d_bottom_decile": 0.000669,
                "tail_over_mid": 1.021
              },
              "original_upb": {
                "spearman_rho": -0.1415,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000514,
                "mean_d_bottom_decile": 0.001058,
                "tail_over_mid": 1.718
              },
              "seller_name": {
                "spearman_rho": -0.0679,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000532,
                "mean_d_bottom_decile": 0.00076,
                "tail_over_mid": 1.167
              },
              "servicer_name": {
                "spearman_rho": -0.0666,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000533,
                "mean_d_bottom_decile": 0.000797,
                "tail_over_mid": 1.234
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "dti",
                "loan_term_months",
                "ltv",
                "mortgage_insurance_pct"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 0.882,
                "dti": 0.0,
                "ltv": 0.0,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.0,
                "loan_purpose": 0.353,
                "num_units": 0.059,
                "num_borrowers": 1.0,
                "first_time_homebuyer": 0.059,
                "property_type": 0.118
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 44487
          },
          "variant_B_compliant_geography_prohibited": {
            "verdict": "ANALYZED",
            "n": 44341,
            "n_default": 110,
            "default_rate": 0.00248,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "original_upb"
            ],
            "band_members_within_eps": 90,
            "band_distinct_by_tree_signature": 69,
            "n_distinct_uf_members": 8,
            "n_distinct_used_feature_sets": 6,
            "distinct_used_feature_sets": [
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "loan_purpose",
                "num_borrowers",
                "num_units"
              ]
            ],
            "n_members_using_extension": 0,
            "extension_features_used_union": [],
            "best_holdout_auc": 0.7683,
            "median_pairwise_spearman": 1.0,
            "min_pairwise_spearman": 0.5146,
            "plural": false,
            "d_summary": {
              "min": 5.2e-05,
              "median": 0.000641,
              "max": 0.019254,
              "std": 0.001517
            },
            "R2_named": 0.9404,
            "R2_all": 0.9404,
            "dR2_ext": 0.0,
            "explainer_named_root_feature": "fico_range_low",
            "explainer_named_top_importances": [
              [
                "fico_range_low",
                0.9541
              ],
              [
                "num_borrowers",
                0.0369
              ],
              [
                "loan_purpose",
                0.0089
              ]
            ],
            "explainer_all_root_feature": "fico_range_low",
            "explainer_all_top_importances": [
              [
                "fico_range_low",
                0.9541
              ],
              [
                "num_borrowers",
                0.0369
              ],
              [
                "loan_purpose",
                0.0089
              ]
            ],
            "extension_importances_in_all_explainer": [],
            "rung_classification": null,
            "pd_shape_d_on_named_root": "tails",
            "well_explained_by_named": true,
            "gap_recurs": false,
            "univariate_spearman_d": {
              "fico_range_low": {
                "spearman_rho": -0.111,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000641,
                "mean_d_bottom_decile": 0.003175,
                "tail_over_mid": 5.307
              },
              "dti": {
                "spearman_rho": 0.0761,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.001064,
                "mean_d_bottom_decile": 0.000723,
                "tail_over_mid": 1.248
              },
              "ltv": {
                "spearman_rho": -0.0477,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000769,
                "mean_d_bottom_decile": 0.001084,
                "tail_over_mid": 1.285
              },
              "cltv": {
                "spearman_rho": -0.0495,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000781,
                "mean_d_bottom_decile": 0.00108,
                "tail_over_mid": 1.282
              },
              "mortgage_insurance_pct": {
                "spearman_rho": -0.0019,
                "spearman_p": 0.6967,
                "mean_d_top_decile": 0.000614,
                "mean_d_bottom_decile": 0.000929,
                "tail_over_mid": 1.052
              },
              "loan_term_months": {
                "spearman_rho": -0.0846,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000702,
                "mean_d_bottom_decile": 0.001608,
                "tail_over_mid": 2.043
              },
              "loan_purpose": {
                "spearman_rho": -0.0646,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000936,
                "mean_d_bottom_decile": 0.001363,
                "tail_over_mid": 1.73
              },
              "num_units": {
                "spearman_rho": 0.028,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000869,
                "mean_d_bottom_decile": 0.000851,
                "tail_over_mid": 1.01
              },
              "num_borrowers": {
                "spearman_rho": -0.6029,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000543,
                "mean_d_bottom_decile": 0.001158,
                "tail_over_mid": 1.342
              },
              "first_time_homebuyer": {
                "spearman_rho": 0.0361,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000757,
                "mean_d_bottom_decile": 0.000881,
                "tail_over_mid": 1.011
              },
              "property_type": {
                "spearman_rho": -0.0104,
                "spearman_p": 0.0279,
                "mean_d_top_decile": 0.000918,
                "mean_d_bottom_decile": 0.000892,
                "tail_over_mid": 1.08
              },
              "original_upb": {
                "spearman_rho": -0.1415,
                "spearman_p": 0.0,
                "mean_d_top_decile": 0.000684,
                "mean_d_bottom_decile": 0.001379,
                "tail_over_mid": 1.686
              }
            },
            "mandatory_feature_enforcement": {
              "R_member_n_qualifying": 0,
              "R_any_union_covers_mandatory": false,
              "R_any_missing_from_union": [
                "cltv",
                "dti",
                "loan_term_months",
                "ltv",
                "mortgage_insurance_pct"
              ],
              "R_majority_all_mandatory_used_by_ge_half_members": false,
              "mandatory_feature_usage_share": {
                "fico_range_low": 0.75,
                "dti": 0.0,
                "ltv": 0.0,
                "cltv": 0.0,
                "mortgage_insurance_pct": 0.0,
                "loan_term_months": 0.0,
                "loan_purpose": 0.5,
                "num_units": 0.125,
                "num_borrowers": 1.0,
                "first_time_homebuyer": 0.125,
                "property_type": 0.25
              },
              "interpretation": "R-majority = each exposed mandatory feature used by >=50% of distinct band members; geometry reported on the full de-duped within-eps band (the construction)"
            },
            "n_combos_tried": 14265
          },
          "seconds": 750.4
        },
        "rb02": {
          "n": 50974,
          "variant_A_geography_admissible": {
            "verdict": "ANALYZED",
            "n": 50974,
            "n_default": 182,
            "default_rate": 0.00357,
            "candidate_named": [
              "fico_range_low",
              "dti",
              "ltv",
              "cltv",
              "mortgage_insurance_pct",
              "loan_term_months",
              "loan_purpose",
              "num_units",
              "num_borrowers",
              "first_time_homebuyer",
              "property_type"
            ],
            "candidate_extension": [
              "property_state",
              "original_upb",
              "seller_name",
              "servicer_name"
            ],
            "band_members_within_eps": 2117,
            "band_distinct_by_tree_signature": 1465,
            "n_distinct_uf_members": 131,
            "n_distinct_used_feature_sets": 55,
            "distinct_used_feature_sets": [
              [
                "dti",
                "fico_range_low"
              ],
              [
                "dti",
                "original_upb"
              ],
              [
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_term_months"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv"
              ],
              [
                "dti",
                "fico_range_low",
                "num_borrowers"
              ],
              [
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "servicer_name"
              ],
              [
                "dti",
                "original_upb",
                "property_state"
              ],
              [
                "dti",
                "original_upb",
                "seller_name"
              ],
              [
                "dti",
                "original_upb",
                "servicer_name"
              ],
              [
                "fico_range_low",
                "first_time_homebuyer",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_purpose",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "loan_term_months",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "ltv",
                "num_borrowers"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "original_upb"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_state"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "property_type"
              ],
              [
                "fico_range_low",
                "num_borrowers",
                "seller_name"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "loan_purpose"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "original_upb"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "property_state"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "seller_name"
              ],
              [
                "cltv",
                "dti",
                "fico_range_low",
                "servicer_name"
              ],
              [
                "cltv",
                "fico_range_low",
                "num_borrowers",
                "seller_name"
              ],
              [
                "dti",
                "fico_range_low",
                "loan_purpose",
                "property_type"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "original_upb"
              ],
              [
                "dti",
                "fico_range_low",
                "ltv",
                "property_state"
              ],
              [
                "dti",
                "fico_range_low",
